---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LinkFailures.DeleteLinkSymbolPrompt
source: html/a1186970-5a26-4ff8-1b9f-ee5f66e1cb19.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LinkFailures.DeleteLinkSymbolPrompt Property

All instances of Linked Model '[Name]' have been deleted, but the file itself is still loaded.
 Remove the Linked File using Manage Links dialog to save memory unless you are going to reuse it in this project.
 Removing the Link cannot be undone.

## Syntax (C#)
```csharp
public static FailureDefinitionId DeleteLinkSymbolPrompt { get; }
```